Chapter02/SalesQuoteDemo/SalesQuoteProcess/SOA/testsuites/MIDynamicPartialJoin.xml

<soap:Envelope xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/">
    	<soap:Body>
        		<ns1:start xmlns:ns1="http://xmlns.oracle.com/bpmn/bpmnProcess/MIDynamicPartialJoin" xmlns:ns2="http://www.mycompany.com/ns/salesquote">
            			<ns2:QuoteRequest>
                				<ns2:Summary>
                    					<ns2:OpportunityID>MIDynamicPartialJoin</ns2:OpportunityID>
                    					<ns2:AccountName>SomeAccountName</ns2:AccountName>
                    					<ns2:NewCustomer>New</ns2:NewCustomer>
                    					<ns2:PurchaseToDate>2011</ns2:PurchaseToDate>
                    					<ns2:Address>
                        						<ns2:Street>Some Address</ns2:Street>
                        						<ns2:City>Miami</ns2:City>
                        						<ns2:State>FL</ns2:State>
                        						<ns2:Zip>33333</ns2:Zip>
                        						<ns2:Country>UK</ns2:Country>
                    </ns2:Address>
                    					<ns2:CustomerType>NEW</ns2:CustomerType>
                    					<ns2:Industry>IT</ns2:Industry>
                    					<ns2:SalesRepId>salesrep</ns2:SalesRepId>
                    					<ns2:SalesRepName></ns2:SalesRepName>
                    					<ns2:SalesRepContact></ns2:SalesRepContact>
                </ns2:Summary>
                				<ns2:ProductItem>
                    					<ns2:ProductID>1</ns2:ProductID>
                    					<ns2:ProductName>1</ns2:ProductName>
                    					<ns2:Quantity>100</ns2:Quantity>
                    					<ns2:ListPrice>1</ns2:ListPrice>
                    					<ns2:PreApprovedDiscount>1</ns2:PreApprovedDiscount>
                    					<ns2:RequestedDiscount>1</ns2:RequestedDiscount>
                    					<ns2:Approval>
                        						<ns2:Approver></ns2:Approver>
                        						<ns2:Title></ns2:Title>
                        						<ns2:ApprovalNote></ns2:ApprovalNote>
                    </ns2:Approval>
                </ns2:ProductItem>
                				<ns2:ProductItem>
                    					<ns2:ProductID>2</ns2:ProductID>
                    					<ns2:ProductName>2</ns2:ProductName>
                    					<ns2:Quantity>200</ns2:Quantity>
                    					<ns2:ListPrice>2</ns2:ListPrice>
                    					<ns2:PreApprovedDiscount>2</ns2:PreApprovedDiscount>
                    					<ns2:RequestedDiscount>2</ns2:RequestedDiscount>
                    					<ns2:Approval>
                        						<ns2:Approver></ns2:Approver>
                        						<ns2:Title></ns2:Title>
                        						<ns2:ApprovalNote></ns2:ApprovalNote>
                    </ns2:Approval>
                </ns2:ProductItem>
                				<ns2:ProductItem>
                    					<ns2:ProductID>3</ns2:ProductID>
                    					<ns2:ProductName>3</ns2:ProductName>
                    					<ns2:Quantity>300</ns2:Quantity>
                    					<ns2:ListPrice>3</ns2:ListPrice>
                    					<ns2:PreApprovedDiscount>3</ns2:PreApprovedDiscount>
                    					<ns2:RequestedDiscount>3</ns2:RequestedDiscount>
                    					<ns2:Approval>
                        						<ns2:Approver></ns2:Approver>
                        						<ns2:Title></ns2:Title>
                        						<ns2:ApprovalNote></ns2:ApprovalNote>
                    </ns2:Approval>
                </ns2:ProductItem>
                				<ns2:ProductItem>
                    					<ns2:ProductID>4</ns2:ProductID>
                    					<ns2:ProductName>4</ns2:ProductName>
                    					<ns2:Quantity>400</ns2:Quantity>
                    					<ns2:ListPrice>4</ns2:ListPrice>
                    					<ns2:PreApprovedDiscount>4</ns2:PreApprovedDiscount>
                    					<ns2:RequestedDiscount>4</ns2:RequestedDiscount>
                    					<ns2:Approval>
                        						<ns2:Approver></ns2:Approver>
                        						<ns2:Title></ns2:Title>
                        						<ns2:ApprovalNote></ns2:ApprovalNote>
                    </ns2:Approval>
                </ns2:ProductItem>
                				<ns2:ProductItem>
                    					<ns2:ProductID>5</ns2:ProductID>
                    					<ns2:ProductName>5</ns2:ProductName>
                    					<ns2:Quantity>500</ns2:Quantity>
                    					<ns2:ListPrice>5</ns2:ListPrice>
                    					<ns2:PreApprovedDiscount>5</ns2:PreApprovedDiscount>
                    					<ns2:RequestedDiscount>5</ns2:RequestedDiscount>
                    					<ns2:Approval>
                        						<ns2:Approver></ns2:Approver>
                        						<ns2:Title></ns2:Title>
                        						<ns2:ApprovalNote></ns2:ApprovalNote>
                    </ns2:Approval>
                </ns2:ProductItem>
                				<ns2:QuoteRequestStatus>NEW</ns2:QuoteRequestStatus>
                				<ns2:RecommendedDiscount>
                    					<ns2:RevenueRange>12345</ns2:RevenueRange>
                    					<ns2:SuggestedDiscount>1</ns2:SuggestedDiscount>
                    					<ns2:FutureDiscountProvision>1</ns2:FutureDiscountProvision>
                </ns2:RecommendedDiscount>
            </ns2:QuoteRequest>
        </ns1:start>
    </soap:Body>
</soap:Envelope>
